---
kind: method
id: M:Autodesk.Revit.DB.PhaseArray.ForwardIterator
source: html/432aeda4-3638-52fa-69d5-aae94f3d61ac.htm
---
# Autodesk.Revit.DB.PhaseArray.ForwardIterator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual PhaseArrayIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the array.